---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExportFontKey Properties
ExportFontKey Class See Also Send Feedback
---

The ExportFontKey type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OriginalFontName | The original font name. |

# See Also

ExportFontKey Class

Autodesk.Revit.DB Namespace